
<template>
  <div class="policy-box">
    <div class="title">
      <h2>利用規約</h2>
      <h2>以下の利用規約に同意の上ご利用ください。</h2>
    </div>
    <div class="policy-content">
      <p>
        本規約は、開発者（以下"乙"といいます。）が提供する本ツールの利用者（以下"甲"といいます。）との間における条件を定めるものです。<br />
        乙は、乙の判断によって、いつでも本規約の内容を変更できます。
      </p>
      <br />

      <ol>
        <li>
          <h4>第1条 利用条件</h4>
          <br />
          ・甲は、本規約に同意した上で、本ツールを利用しなければなりません。<br />
          ・パケット料金、データ利用量等の通信料は甲が負担するものとします。
        </li>

        <li>
          <h4>第2条 禁止事項</h4>
          <br />
          甲は、本ツールの利用にあたり、以下に定める行為又はそのおそれがある行為を行ってはならないものとします。<br />
          <br />
          <h4>1 法令違反行為等</h4>
          <br />
          ・法令及び本規約に違反する行為<br />
          ・乙または第三者に対する詐欺または脅迫行為<br />
          ・公序良俗に反する行為<br />
          ・乙または第三者の知的財産権、肖像権、プライバシー、名誉その他の権利または利益を侵害する行為<br />
          <br />
          <h4>2 不適切情報の送信等</h4>
          <br />
          ・以下に定める情報を送信または公開する行為（同音異義語、伏せ字、当て字またはリンク等を利用して当該情報を送信、伝達、投稿または公開する行為を含みます。）<br />
          ・
          過度に暴力的な表現、残虐な表現、差別的な表現その他の他人に不快感を与えるおそれのある情報<br />
          ・ 未成年者に悪影響を及ぼすおそれのある情報<br />
          ・ 営利の宣伝広報を目的とした情報<br />
          ・ 自己または第三者の個人情報<br />
          <br />
          <h4>3 営利行為等</h4>
          <br />
          ・本ツールを利用した営利行為<br />
          <br />
          <h4>4 本ツールが準ずる利用規約に違反する行為</h4>
          <br />
          ・本ツールが利用する「MELTY BLOOD: TYPE
          LUMINA」のファンキットの利用規約に違反する行為
          <br />
          <h4>5 その他の不正行為等</h4>
          <br />
          ・本規約に違反する行為または乙が不適切と判断する行為
        </li>

        <li>
          <h4>免責</h4>
          <br />
          ①
          甲は自己責任において本ツールを利用するものとし、甲と他の利用者との紛争その他のトラブル等に関して、乙は一切の責任を負いません。また、乙は第三者の本ツールの利用等について一切の責任を負いません。<br />
          <br />
          ②
          乙は、乙の事情または天災地変、疫病、社会的動乱、火災、停電、通信インフラの停止その他の支配できない事由に起因して、本ツールの内容を変更すること、または本ツール利用を中断・中止することがあります。<br />
          <br />
          ③
          乙の故意・重過失による場合、その他法令で免責が認められない場合を除き、乙は、本ツールに関する一切の責任を負いません。
        </li>

        <li>
          <h4>個人情報</h4>
          <br />
          本ツールの利用に際して収集した甲の個人情報は、プロフィールカード制作の目的で使用します。
        </li>
      </ol>
    </div>
  </div>
</template>
<script>
export default {};
</script>
<style scoped>
.title {
  padding: 20px 0 20px 0;
}
.policy-box {
  height: 400px; /* 横幅を200pxに指定 */
  margin-left: auto;
  margin-right: auto;
  margin-top: 100px;
  background-color: rgba(0, 4, 59, 0.6);
}
.policy-box .title {
  color: aliceblue;
  font-family: "Noto Serif JP", serif;
  text-align: center;
  font: bold;
  font-size: 18px;
  /* margin-top: 30px; */
  margin: 30px 0;
}
.policy-content {
  width: 90%; /* 横幅を200pxに指定 */
  /* height: 200px; 横幅を200pxに指定 */
  height: 50%;
  overflow-y: scroll; /* 縦方向にスクロール可能にする */
  color: aliceblue;
  font-family: "Noto Serif JP", serif;
  margin-left: auto;
  margin-right: auto;
}
</style>
